In [2]:
import numpy as np 
import pandas as pd

In [3]:
df = pd.read_csv("raw_data.csv")
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [3]:
# 1 - shift id column to the end 
# list comprehension

In [5]:
df2 = df.copy()
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [9]:
new_col_order = [col for col in df2.columns if col != "id"]+["id"]
print(new_col_order)
df2[new_col_order]

['name', 'age', 'country', 'gender', 'income', 'id']

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [20]:
# writing to csv
df2 = df.copy()

df2 = df2.drop_duplicates()
df2 = df2.fillna(0)

df2 = df2.sort_values("income")

df2 = df2.reset_index(drop = True)

df2.to_csv("sorted_data.csv")

In [23]:

# grouping and aggregation of data  

df.groupby("country")["income"].mean()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       55400.0
Name: income, dtype: float64

In [24]:
df.groupby("country")["income"].min()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       47000.0
Name: income, dtype: float64

In [25]:
df.groupby("country")["income"].max()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       62000.0
Name: income, dtype: float64

In [27]:
df.groupby("gender")["income"].mean()
df.groupby("gender")["income"].max()

gender
Female     73000.0
Male       68000.0
Unknown    47000.0
Name: income, dtype: float64

In [28]:
df.groupby("country")["income"].agg(["mean","max","min"])

            mean      max      min
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  62000.0  47000.0

In [29]:
df.groupby("country")["income"].aggregate(["mean","max","min"])

            mean      max      min
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  62000.0  47000.0

In [31]:
df.groupby("country")["income"].agg(avg_salary = "mean",max_salary = "max",min_salary = "min")

         avg_salary  max_salary  min_salary
country
Canada      62000.0     62000.0     62000.0
China       51000.0     51000.0     51000.0
India       73000.0     73000.0     73000.0
Mexico      45000.0     45000.0     45000.0
Spain           NaN         NaN         NaN
USA         55400.0     62000.0     47000.0

In [36]:
df.groupby("country").agg({

    "income" : "max",
    "age" : "mean"

})

df.groupby("country").agg(

    max_salary=("income", "max"),
    avg_salary=("age", "mean")

)

         max_salary  avg_salary
country
Canada      62000.0         NaN
China       51000.0        27.0
India       73000.0        45.0
Mexico      45000.0         NaN
Spain           NaN        34.0
USA         62000.0        29.5

In [8]:
 # melt and pivot
# melt -- wide to long format 
# pivot -- long to wide format

df = pd.DataFrame({
    "country": ["USA","USA","INDIA","INDIA"],
    "year": [2020,2021,2020,2021],
    "sales": [100,120,90,110],
    "profit": [20,25,15,18]
})

melted_df = df.melt(
    id_vars=["country", "year"],
    value_vars=["sales", "profit"],
    var_name="metrics",
    value_name="value"
)
melted_df

  country  year metrics  value
0     USA  2020   sales    100
1     USA  2021   sales    120
2   INDIA  2020   sales     90
3   INDIA  2021   sales    110
4     USA  2020  profit     20
5     USA  2021  profit     25
6   INDIA  2020  profit     15
7   INDIA  2021  profit     18

In [14]:
original = melted_df.pivot(
    index = ["country" ,"year"],
    columns = "metrics",
    values = "value"
)
original

metrics       profit  sales
country year
INDIA   2020      15     90
        2021      18    110
USA     2020      20    100
        2021      25    120

In [56]:
# basic visulaization

In [57]:
df

  country  year  sales  profit
0     USA  2020    100      20
1     USA  2021    120      25
2   INDIA  2020     90      15
3   INDIA  2021    110      18

In [ ]:
df = pd.read_csv("employee_data.csv")

#df["AGE"].hist()

df.plot(kind = "scatter ",x = "Age" , y="Salary")

In [ ]:
# merging and joing the daata

In [77]:
df_customers = pd.DataFrame({
    "customer_id":[101,102,103,104],
    "name" : ["harsh","harsh1", "harsh2","harsh3"]
})

df_orders = pd.DataFrame({
    "order_id":[101,102,103,104],
     "customer_id":[2,1,4,5],
     "amount":[250,120,300,180]
    
})

pd.merge(df_customers ,df_orders ,on="customer_id") # innere join 

# left join 

pd.merge(df_customers ,df_orders ,on="customer_id",how="left")
pd.merge(df_customers ,df_orders ,on="customer_id",how="right") # right join
pd.merge(df_customers ,df_orders ,on="customer_id",how="outer") # outer join

   customer_id    name  order_id  amount
0            1     NaN     102.0   120.0
1            2     NaN     101.0   250.0
2            4     NaN     103.0   300.0
3            5     NaN     104.0   180.0
4          101   harsh       NaN     NaN
5          102  harsh1       NaN     NaN
6          103  harsh2       NaN     NaN
7          104  harsh3       NaN     NaN

In [69]:
df_customers

   customer_id    name
0          101   harsh
1          102  harsh1
2          103  harsh2
3          104  harsh3

In [70]:
df_orders

   order_id  customer_id  amount
0       101            2     250
1       102            1     120
2       103            4     300
3       104            5     180

In [79]:
# data concatenation in pandas 
df1 = pd.DataFrame({
    "id":[1,2,3],
    "name":["adam","Eve","bob"]
    
})

df2 = pd.DataFrame({
    "id":[1,2,3],
    "name":["adam1","Eve1","bob1"]
    
})

In [80]:
df1

   id  name
0   1  adam
1   2   Eve
2   3   bob

In [81]:
df2

   id   name
0   1  adam1
1   2   Eve1
2   3   bob1

In [83]:
pd.concat([df1,df2])

   id   name
0   1   adam
1   2    Eve
2   3    bob
0   1  adam1
1   2   Eve1
2   3   bob1

In [84]:
pd.concat([df1,df2],axis = 1)

   id  name  id   name
0   1  adam   1  adam1
1   2   Eve   2   Eve1
2   3   bob   3   bob1